void Can2() {
  BB(40, 510, 'R'); motorStop(); delay(50);  //2 ช่อง go 1 block
  SetBack(25, 200, 'R'); motorStop(); delay(50);   //เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว SetBack(ความเร็วมอเตอร์ทั้ง 4 ตัว, ระยะทางนับเวลาเดินออกจากเส้นดำ 1000=1วินาที, เลือกทิศทางเลี้ยว)
  FF(80, 720); motorStop(); delay(50);  //3 ช่อง go 2 block
  SetFront(25, 260, 'L'); motorStop(); delay(50);   //เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว SetBack(ความเร็วมอเตอร์ทั้ง 4 ตัว, ระยะทางนับเวลาเดินออกจากเส้นดำ 1000=1วินาที, เลือกทิศทางเลี้ยว)
  pickCan(5, NO_SWITCH_LR); motorStop(); delay(50); BB(40, 350);
  BB(80, 720, 'R'); motorStop(); delay(50);  //3 ช่อง go 2 block
  SetBack(25, 200, 'L'); motorStop(); delay(50);   //เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว SetBack(ความเร็วมอเตอร์ทั้ง 4 ตัว, ระยะทางนับเวลาเดินออกจากเส้นดำ 1000=1วินาที, เลือกทิศทางเลี้ยว)
  BB(60, 560, 'R'); motorStop(); delay(50); //2 ช่อง go 1 block 
  placeCan1(4.5, 3, 'r', 'c'); 
  BB(40, 510, 'R'); motorStop(); delay(50);
  FF(50, 520); motorStop(); delay(50); //2 ช่อง go 1 block
  SetFront(30, 200, 'L'); motorStop(); delay(50);
  FF(50, 520); motorStop(); delay(50); //2 ช่อง go 1 block
  SetFront(30, 200, 'R'); motorStop(); delay(50);
  FF(60, 520, 'R'); motorStop(); delay(50); //2 ช่อง go 1 block
  SetBack(25, 200, 'L'); motorStop(); delay(50);   //เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว SetBack(ความเร็วมอเตอร์ทั้ง 4 ตัว, ระยะทางนับเวลาเดินออกจากเส้นดำ 1000=1วินาที, เลือกทิศทางเลี้ยว)
  placeCan1(9.8, 3, 'r', 'l'); 


  
  
  







  
}
