#include <ATX2.h>

// กำหนดค่าอ้างอิง (Reference) แยกเส้นดำและพื้นขาว
int Ref_L0 = 620;  // ซ้ายสุด
int Ref_L1 = 590;  // ซ้าย
int Ref_R2 = 610;  // ขวา
int Ref_R3 = 570;  // ขวาสุด

// ตัวแปรสำหรับอ่านค่าเซ็นเซอร์ (ควรเรียกอัปเดตค่าตอนจะใช้งานจริงด้วย)
int L0 = analog(0);
int L1 = analog(1);
int R2 = analog(2);
int R3 = analog(3);

void setup() {
  // ตั้งค่าเริ่มต้นของบอร์ด
  XIO();
  beep();
  OK();
  delay(500);
  glcdMode(0);
  glcdClear();
  setTextSize(1);

  // ลำดับการทำงาน
  // Slide_Calibration();
  // ForwardTrackLineTime(20, 3500);  // เดินหน้าตามเส้นเป็นเวลา (หรือจำนวนลูป) 3500ms
  // ForwardTrackLineStop(20, 0);     // เดินหน้าตามเส้นจนกว่าเซ็นเซอร์ 0 จะเจอเส้น
  // ForwardLineStop(20, 20, 3);      // เดินหน้าจนเจอจนกว่าเซ็นเซอร์ 3 จะเจอเส้น
  // ForwardDelay(20, 20, 350);       // เดินหน้าข้ามเส้นไป 350ms
  // SRsensor(1, 20, 350);            // หน่วง 350ms แล้วเลี้ยวขวาจนกว่าเซ็นเซอร์ 1 จะเจอเส้น
  // SLsensor(2, 20, 350);            // หน่วง 350ms แล้วเลี้ยวซ้ายจนกว่าเซ็นเซอร์ 2 จะเจอเส้น

}

void loop() {
  // ไม่มีการทำงานแบบวนซ้ำ (หุ่นยนต์วิ่งตามสเต็ปใน setup ครั้งเดียวแล้วจบ)
}