void Experiment() {
// PickCanNew(8, 60, 275);
// placeCan1_1_Norechack(18, 300,'a','a', 60, 250);
// G = 8
// Y = 13
// R = 15

///////////////////////////////////////////////

// FF(100, 425);  // เดินหน้าตรง 1 ช่อง
// FF(100, 630);  // เดินหน้าตรง 2 ช่อง
// FF(100, 840);  // เดินหน้าตรง 3 ช่อง

///////////////////////////////////////////////

// ความเชื่อย 330
// FF(60, 550);  // เดินหน้าตรง 1 ช่อง
// FF(60, 880);  // เดินหน้าตรง 2 ช่อง
// FF(60, 1210); // เดินหน้าตรง 3 ช่อง
// FF(60, 1500); // High Way

///////////////////////////////////////////////

//        IN                 OUT
// SetFront(25, 230);  SetFront(25, 255);
// SetBack(25, 230);   SetBack(25, 255);

  Lab_1();
  Lab_2();
  Lab_3();
  Lab_4();
}

void Lab_1() {
  SetFront(25, 230, 'R');
}

void Lab_2() {

}

void Lab_3() {

}

void Lab_4() {

}