// FF(100, 1050);  // เดินหน้าขึ้นสะพาน
// FF(100, 875);   // เดินหน้าตรง 3 ช่อง
// FF(100, 650);   // เดินหน้าตรง 2 ช่อง
// FF(100, 430);   // เดินหน้าตรง 1 ช่อง
// FF(100, 220);   // เดินหน้าตรง ครึ่งช่อง
// FF(30, 2150);   // เดินข้ามทางลูกระนาด
// FF(20, 3500);   // เดินข้ามทางลูกระนาด กรณีมีกระป๋องอยู่ในถาด
///////////////////////////////////////////////
// BB(100, 1050);  // ถอยหลังขึ้นสะพาน
// BB(100, 875);   // ถอยหลังตรง 3 ช่อง
// BB(100, 650);   // ถอยหลังตรง 2 ช่อง
// BB(100, 430);   // ถอยหลังตรง 1 ช่อง
// BB(100, 220);   // ถอยหลังตรง ครึ่งช่อง
///////////////////////////////////////////////
// SetFront(25);            // เช็ตหน้าตรง เมื่อเจอเส้นดำแล้วหยุด
// SetFront(25, 235, 'R');  // เช็ตหน้าตรง เมื่อเจอเส้นดำ จะถอยออกจากเส้นดำ พร้อมเลี้ยว
// SetFront_Wall(25, 235, 'L');
///////////////////////////////////////////////
// SetBack(25);            // เช็ตหลังตรง เจอเส้นดำ จะหยุด
// SetBack(25, 210, 'L');  // เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว
///////////////////////////////////////////////
// spinDegree(-90);  // หมุนซ้าย spinDegree(ระยะองศาเลี้ยว**ใช้เซ็นเซอร์ไจโร**)
// spinDegree(90);   // หมุนขวา spinDegree(ระยะองศาเลี้ยว**ใช้เซ็นเซอร์ไจโร**)
///////////////////////////////////////////////
// lift(2);     // ยกเสาสไลด์ขึ้นและลง
// delay(100);  // เวลาในการยก
///////////////////////////////////////////////
// retractArm();  // พับแขนออกนอกตัว 90 องศา (ป้องกันการชนขอบสนาม)
// extendArm();   // กางแขนเข้าท่าเตรียมหยิบ
// setCan();      // วางกระป๋องบนพื้นและหยิบใหม่
///////////////////////////////////////////////
// STOP();  //สั่งหยุด กด SW1 or SW2 เพื่อทำงานต่อ
///////////////////////////////////////////////
// autoPickCan(5);    // หยิบกระป๋องแบบแยกสีอัตโนมัติ autoPickCan(ความสูง หน่วยเป็นเซ็นติเมตร)
// autoPlaceCan(10);  // วางกระป๋องแบบแยกสีอัตโนมัติ placeCan(ความสูง หน่วยเป็นเซ็นติเมตร)

// placeCan1_NoShake(5, NO_SWITCH_LR, 60, 500);

void Can1() {
  // SetBack(25, 210);
  // FF(100, 650);
  // SetFront(25, 235, 'L');
  // placeCan1_NoShake(5, NO_SWITCH_LR, 60, 400);  // R G
  beep(50);
}

void Can2() {
  spinDegree(-90);
  FF(100, 435, 'R');
  FF(100, 400);
  SetFront_Wall(25, 235, 'L');
  placeCan1_NoShake('R', 'L', 'C', 30, 440);
}

void Can3() {
}

void Can4() {
}

void Can5() {
}

void Can6() {
}

void Can7() {
}

void Can8() {
}

void Can9() {
}

void Can10() {
}

void CanEnd() {
}