void Experiment() {
  // PickCanNew(5, 60, 250);
  // placeCan1_1_Norechack(8, 300, 'a', 'a', 60, 250);
  // G = 8
  // Y = 13
  // R = 15

  ///////////////////////////////////////////////

  // ความเชื่อย 205
  // FF(100, 425);  // เดินหน้าตรง 1 ช่อง
  // FF(100, 630);  // เดินหน้าตรง 2 ช่อง
  // FF(100, 840);  // เดินหน้าตรง 3 ช่อง

  ///////////////////////////////////////////////

  // ความเชื่อย 330 | ลดจากเดิม 125
  // FF(60, 550);  // เดินหน้าตรง 1 ช่อง
  // FF(60, 880);  // เดินหน้าตรง 2 ช่อง
  // FF(60, 1210); // เดินหน้าตรง 3 ช่อง
  // FF(60, 1500); // High Way

  ///////////////////////////////////////////////

  // ความเชื่อย 510
  // FF(40, 700);   // เดินหน้าตรง 1 ช่อง
  // FF(40, 1210);  // เดินหน้าตรง 2 ช่อง
  // FF(40, 1720);  // เดินหน้าตรง 3 ช่อง
  // FF(40, 2200);  // High Way

  ///////////////////////////////////////////////

  //        IN                 OUT
  // SetFront(25, 210); 200  SetFront(25, 240);
  // SetBack(25, 220);  200  SetBack(25, 275);

  Lab_1();
  Lab_2();
  Lab_3();
  Lab_4();
}

void Lab_1() {
  placeCan1_1_Norechack(8, 300, 'A', 'A', 60, 250);
  placeCan1_1_Norechack(8, 300, 'L', 'L', 60, 250);
  placeCan1_1_Norechack(8, 300, 'R', 'C', 60, 250);
  placeCan1_1_Norechack(8, 300, 'L', 'A', 60, 250);
}

void Lab_2() {
}

void Lab_3() {
}

void Lab_4() {
}