// FF(100, 1050);  // เดินหน้าขึ้นสะพาน
// FF(100, 875);   // เดินหน้าตรง 3 ช่อง
// FF(100, 650);   // เดินหน้าตรง 2 ช่อง
// FF(100, 430);   // เดินหน้าตรง 1 ช่อง
// FF(100, 220);   // เดินหน้าตรง ครึ่งช่อง
// FF(30, 2150);   // เดินข้ามทางลูกระนาด
// FF(20, 3500);   // เดินข้ามทางลูกระนาด กรณีมีกระป๋องอยู่ในถาด
///////////////////////////////////////////////
// BB(100, 830);   // ถอยหลังตรง 3 ช่อง
// BB(100, 600);   // ถอยหลังตรง 2 ช่อง
// BB(100, 380);   // ถอยหลังตรง 1 ช่อง
// BB(100, 220);   // ถอยหลังตรง ครึ่งช่อง
// BB(100, 1050);  // ถอยหลังขึ้นสะพาน
///////////////////////////////////////////////
// SetFront(25);            // เช็ตหน้าตรง เมื่อเจอเส้นดำแล้วหยุด
// SetFront(25, 235, 'R');  // เช็ตหน้าตรง เมื่อเจอเส้นดำ จะถอยออกจากเส้นดำ พร้อมเลี้ยว
///////////////////////////////////////////////
// SetBack(25);            // เช็ตหลังตรง เจอเส้นดำ จะหยุด
// SetBack(25, 210, 'L');  // เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว
///////////////////////////////////////////////
// spinDegree(-90);  // หมุนซ้าย spinDegree(ระยะองศาเลี้ยว**ใช้เซ็นเซอร์ไจโร**)
// spinDegree(90);   // หมุนขวา spinDegree(ระยะองศาเลี้ยว**ใช้เซ็นเซอร์ไจโร**)
///////////////////////////////////////////////
// lift(2);     // ยกเสาสไลด์ขึ้นและลง
// delay(100);  // เวลาในการยก
///////////////////////////////////////////////
// retractArm();  // พับแขนออกนอกตัว 90 องศา (ป้องกันการชนขอบสนาม)
// extendArm();   // กางแขนเข้าท่าเตรียมหยิบ
// setCan();      // วางกระป๋องบนพื้นและหยิบใหม่
///////////////////////////////////////////////
// STOP();  //สั่งหยุด กด SW1 or SW2 เพื่อทำงานต่อ
///////////////////////////////////////////////
// autoPickCan(5);    // หยิบกระป๋องแบบแยกสีอัตโนมัติ autoPickCan(ความสูง หน่วยเป็นเซ็นติเมตร)
// autoPlaceCan(10);  // วางกระป๋องแบบแยกสีอัตโนมัติ placeCan(ความสูง หน่วยเป็นเซ็นติเมตร)
///////////////////////////////////////////////
///////////////ทำใหม่///////////////////////////

// PickCanNew(8, 60, 300);
// placeCan1_1_Norechack(18,300,'a','a', 60, 300);
// ยกB1 = 8
// ยกB2 = 13
// ยกB3 = 16

///////////////////////////////////////////////

// FF(100, 840);   // เดินหน้าตรง 3 ช่อง
// FF(100, 630);   // เดินหน้าตรง 2 ช่อง
// FF(100, 425);   // เดินหน้าตรง 1 ช่อง

///////////////////////////////////////////////

// SetFront(25, 235);
// SetBack(25, 100);

void Can1() {
  // placeCan1_1_Norechack(15, 300, 'L', 'C', 60, 675); // 300

  SetFront(25, 240, 'R');
  PickCanNew(5, 60, 350);
  SetBack(25, 200, 'R');
  FF(100, 425);
  placeCan1_1_Norechack(13, 300, 'R', 'C', 60, 300);

  spinDegree(-90);
  SetBack(25, 200);
  FF(100, 630, 'R');
  placeCan1_1_Norechack(8, 300, 'L', 'C', 60, 300);

  spinDegree(-90);
  PickCanNew(5, 60, 350);
  spinDegree(90);
  placeCan1_1_Norechack(8, 300, 'L', 'L', 60, 300);

  spinDegree(90);
  FF(100, 630);
  SetFront(25, 300, 'L');
  placeCan1_1_Norechack(13, 300, 'R', 'R', 60, 675);
  // TAL();
}

void TAL() {
  SetFront_Wall(25, 200, 'L');
  PickCanNew(5, 60, 350);
  SetBack(25, 135, 'L');
  placeCan1_1_Norechack(8, 300, 'A', 'A', 60, 300);
  // placeCan1_1_Norechack(8, 300, 'R', 'R', 60, 300);

  // SetBack(25, 170, 'R');
  // PickCanNew(5, 60, 350);
  // SetBack(25, 135, 'L');
  // placeCan1_1_Norechack(13, 300, 'R', 'C', 60, 300);
  // placeCan1_1_Norechack(13, 300, 'L', 'L', 60, 300);

  // SetBack(25, 170, 'R');
  // PickCanNew(5, 60, 350);
  // SetBack(25, 135, 'L');
  // placeCan1_1_Norechack(16, 300, 'L', 'C', 60, 300);
  // placeCan1_1_Norechack(16, 300, 'R', 'R', 60, 300);
}