// FF(100, 1050);  // เดินหน้าขึ้นสะพาน
// FF(30, 2150);   // เดินข้ามทางลูกระนาด
// FF(20, 3500);   // เดินข้ามทางลูกระนาด กรณีมีกระป๋องอยู่ในถาด
///////////////////////////////////////////////
// BB(100, 1050);  // ถอยหลังขึ้นสะพาน

///////////////////////////////////////////////
// SetFront(25);            // เช็ตหน้าตรง เมื่อเจอเส้นดำแล้วหยุด
// SetFront(25, 235, 'R');  // เช็ตหน้าตรง เมื่อเจอเส้นดำ จะถอยออกจากเส้นดำ พร้อมเลี้ยว
// SetFront_Wall(25, 235, 'L');
///////////////////////////////////////////////
// SetBack(25);            // เช็ตหลังตรง เจอเส้นดำ จะหยุด
// SetBack(25, 210, 'L');  // เช็ตหลังตรง เมื่อเจอเส้นดำ จะถอยเดินจากเส้นดำ พร้อมเลี้ยว
///////////////////////////////////////////////
// spinDegree(-90);  // หมุนซ้าย spinDegree(ระยะองศาเลี้ยว**ใช้เซ็นเซอร์ไจโร**)
// spinDegree(90);   // หมุนขวา spinDegree(ระยะองศาเลี้ยว**ใช้เซ็นเซอร์ไจโร**)
///////////////////////////////////////////////
// lift(2);     // ยกเสาสไลด์ขึ้นและลง
// delay(100);  // เวลาในการยก
///////////////////////////////////////////////
// retractArm();  // พับแขนออกนอกตัว 90 องศา (ป้องกันการชนขอบสนาม)
// extendArm();   // กางแขนเข้าท่าเตรียมหยิบ
// setCan();      // วางกระป๋องบนพื้นและหยิบใหม่
///////////////////////////////////////////////
// STOP();  //สั่งหยุด กด SW1 or SW2 เพื่อทำงานต่อ
///////////////////////////////////////////////
// autoPickCan(5);    // หยิบกระป๋องแบบแยกสีอัตโนมัติ autoPickCan(ความสูง หน่วยเป็นเซ็นติเมตร)
// autoPlaceCan(10);  // วางกระป๋องแบบแยกสีอัตโนมัติ placeCan(ความสูง หน่วยเป็นเซ็นติเมตร)

// placeCan1_NoShake(5, NO_SWITCH_LR, 60, 500);

  //      0.5              1               2           3 Chunks
  // FF(100, 430); | FF(100, 430); | FF(100, 650); | FF(100, 875);
  // BB(100, 430); | BB(100, 430); | BB(100, 650); | BB(100, 875);

  // placeCan1_NoShake_Enhanced - 255
  //         IN                  OUT
  //  SetBack(20, 270); | SetBack(20, 290);
  // SetFront(20, 370); | SetFront(20, 490);

void operation() {
  mission_1();
}

void mission_1() {
  pickCan_NoShake_Enhanced(5, NO_SWITCH_LR, 30, 700);
  spinDegree(-90);
  PLACE_LOCK_SONAR(10, 'L');
}

void mission_2() {

}

void mission_3() {

}

void mission_4() {

}

void mission_5() {

}